#1. Розробити програму "Фізичний калькулятор". Вибір
#надається із "Швидкість, Час, Шлях". Користувач
#обирає потрібну формулу, вводить дані і отримує
#результат в залежності від формули. Реалізувати
#завдяки словникам і lambda функціям.

reshenie={'шлях':(lambda v,t:v*t),'швидкість':(lambda s,t:s/t),'час':(lambda s,v:s/v)}
vibor_reshenie=input('Оберіть що треба розрахувати(шлях /  швидкість / час)')
if vibor_reshenie.lower() == 'шлях':
    variableV = float(input('Задайте чому дорівнює швидкість предмету в системі СИ: '))
    variableT = float(input('Задайте чому дорівнює час руху в системі СИ: '))
    print('Пройденний шлях =', reshenie['шлях'](variableV, variableT), 'м')
elif vibor_reshenie.lower() == 'швидкість':
    variableS = float(input('Задайте чому дорівнює пройдений шлях в системі СИ: '))
    variableT = float(input('Задайте чому дорівнює час руху в системі СИ: '))
    print('Швидкість =', reshenie['швидкість'](variableS, variableT), 'м/с')
elif vibor_reshenie.lower() == 'час':
    variableS = float(input('Задайте чому дорівнює пройдений шлях в системі СИ: '))
    variableV = float(input('Задайте чому дорівнює швидкість предмету в системі СИ: '))
    print('Час рух =', reshenie['час'](variableS, variableV), 'с')
else:
    print('Невірні данні')


#2. Відсортувати список елементів за критерієм "парності". Видрукувати лише парні елементи

spysok=[1,2,3,4,5,6,7,8,9,10,58,90,47,21]
print('Вхідний список',spysok)
spysok2=list(filter(lambda x: x%2==0,spysok))
print('Відфільтрованний за "парностью "список',spysok2)

#3. Відсортувати список елементів за критерієм "ділення на три". Видрукувати лише елементи, що
#діляться націло на 3.

spysok=[1,2,3,4,5,6,7,8,9,10,58,90,47,21]
print('Вхідний список',spysok)
spysok2=list(filter(lambda x: x%3==0,spysok))
print('Відфільтрованний за критерієм "ділення на три" список',spysok2)


