#Завдання 1
#Користувач вводить з клавіатури три цифри. Створіть
#число, яке містить ці цифри. Наприклад, якщо з клавіатури
#введено 1, 5, 7, ви маєте сформувати число 157

number1 = int(input('Задайте значення першого числа:'))
number2 = int(input('Задайте значення другого числа:'))
number3 = int(input('Задайте значення третього числа:'))
print(number1,number2,number3,sep='')

#Завдання 2
#Користувач вводить з клавіатури число, яке складається
#із чотирьох цифр, а ви маєте знайти їх добуток. Наприклад,
#якщо з клавіатури введено 1324, то результат добутку буде
#1*3*2*4 = 24.

zminna = int(input('ведите 4-х значное число'))
zminna1 = int(zminna /10)
units = zminna- (zminna1*10)
zminna2 = int(zminna1 / 10)
tens = zminna1 - (zminna2 * 10)
zminna3 = int(zminna2 / 10)
hundreds = zminna2 - (zminna3 * 10)
zminna4 = int(zminna3 / 10)
thousands = zminna3 - (zminna4 * 10)
dobutok = units*tens*hundreds*thousands
print(units,'*',tens,'*',hundreds,'*',thousands,'=',dobutok)

#Завдання 3
#Користувач вводить з клавіатури якусь кількість метрів.
#Виведіть результат конвертування метрів у сантиметри, дециметри, міліметри, милі.

metr = float(input('Введить довжину в метра'))
centimeter = metr*100
decimeter = metr*10
millimeter = metr*1000
mile = metr/1609
print(metr,'метрів =',centimeter,'см')
print(metr,'метрів =',decimeter,'дм')
print(metr,'метрів =',millimeter,'мм')
print(metr,'метрів =',mile,'милі')

#Завдання 4
#Напишіть програму, яка обчислює площу трикутника.
#Користувач вводить з клавіатури розмір основи трикутника
#та його висоту

try:
    height = float(input('Задайте висоту трикутника: '))
    osnova = float(input('Задайте основу трикутника: '))
    space = height * osnova/2
    print('Площа трикутника =',space)
except:
    print('Помилка!Параметри трикутника повинні мати числове значення.')

#Завдання 5
#Користувач вводить з клавіатури чотиризначне число.
#Переверніть це число і виведіть результат. Наприклад, якщо
#введено 4512, результат буде 2154.

number = input('Введить чотирьохзначне ціле число:')
for c in str(number)[ : : -1]:
 print(c)



